Generate_blockMeshDict/inclined_plate/original/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                |                                                  |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox            |
|  \    /   O peration     | Version:  5                                      |
|   \  /    A nd           | Web:      www.OpenFOAM.org                       |
|    \/     M anipulation  |                                                  |
\*---------------------------------------------------------------------------*/
FoamFile
{
   version     2.0;
   format      ascii;
   class       dictionary;
   object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 -0.05)
    (4.0 0 -0.05)
    (0 0.25 -0.05)
    (4.0 0.25 -0.05)
    (5.0 0.25 -0.05)
    (0 1 -0.05)
    (4.0 1 -0.05)
    (5.0 1 -0.05)
    (0 0 0.05)
    (4.0 0 0.05)
    (0 0.25 0.05)
    (4.0 0.25 0.05)
    (5.0 0.25 0.05)
    (0 1 0.05)
    (4.0 1 0.05)
    (5.0 1 0.05)
    (15 0.25 -0.05)
    (15 1 -0.05)
    (5.0 0 -0.05)
    (15 0 -0.05)
    (15 0.25 0.05)
    (15 1 0.05)
    (5.0 0 0.05)
    (15 0 0.05)
);

blocks
(
    hex (0 1 4 2 8 9 12 10) (480 40 1) simpleGrading (0.25 1 1)
    hex (2 4 7 5 10 12 15 13) (480 128 1) simpleGrading (0.25 0.25 1)
    hex (4 16 17 7 12 20 21 15) (720 128 1) simpleGrading (4.0 0.25 1)
    hex (18 19 16 4 22 23 20 12) (720 20 1) simpleGrading (4.0 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 8 10 2)
            (2 10 13 5)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (19 16 20 23)
		 (16 17 21 20)
        );
    }
    bottom
    {
        type wall;
        faces
        (
            //(0 1 9 8)
            //(18 19 23 22)
        );
    }
    top
    {
        type wall;
        faces
        (
            (5 13 15 7)
            (17 7 15 21)
        );
    }
    obstacle
    {
        type wall;
        faces
        (
            (9 1 4 12)
            (4 18 22 12)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
